Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_gptim.h
#define    GPTIM_CCMR_CCS_Pos                                     (0U)
#define    GPTIM_CCMR_CCS_Msk                                     (0x3U << GPTIM_CCMR_CCS_Pos)
#define    GPTIM_CCMR_CCS                                         GPTIM_CCMR_CCS_Msk

#define    GPTIM_CCER_CCOP_Pos                                    (1U)
#define    GPTIM_CCER_CCOP_Msk                                    (0x1U << GPTIM_CCER_CCOP_Pos)
#define    GPTIM_CCER_CCOP                                        GPTIM_CCER_CCOP_Msk

#define    GPTIM_CCER_CCIP_Pos                                    (1U)
#define    GPTIM_CCER_CCIP_Msk                                    (0x1U << GPTIM_CCER_CCIP_Pos)
#define    GPTIM_CCER_CCIP                                        GPTIM_CCER_CCIP_Msk

#define    GPTIM_CCER_CCE_Pos                                     (0U)
#define    GPTIM_CCER_CCE_Msk                                     (0x1U << GPTIM_CCER_CCE_Pos)
#define    GPTIM_CCER_CCE                                         GPTIM_CCER_CCE_Msk

#define    GPTIM_CCER_CCONP_Pos                                   (3U)
#define    GPTIM_CCER_CCONP_Msk                                   (0x1U << GPTIM_CCER_CCONP_Pos)
#define    GPTIM_CCER_CCONP                                       GPTIM_CCER_CCONP_Msk

#define    GPTIM_CCER_CCINP_Pos                                   (3U)
#define    GPTIM_CCER_CCINP_Msk                                   (0x1U << GPTIM_CCER_CCINP_Pos)
#define    GPTIM_CCER_CCINP                                       GPTIM_CCER_CCINP_Msk

#define    GPTIM_ECR_IPOS_Pos                                     (6U)
#define    GPTIM_ECR_IPOS_Msk                                     (0x3U << GPTIM_ECR_IPOS_Pos)
#define    GPTIM_ECR_IPOS                                         GPTIM_ECR_IPOS_Msk

#define    GPTIM_ECR_FIDX_Pos                                     (5U)
#define    GPTIM_ECR_FIDX_Msk                                     (0x1U << GPTIM_ECR_FIDX_Pos)
#define    GPTIM_ECR_FIDX                                         GPTIM_ECR_FIDX_Msk

#define    GPTIM_ECR_IDIR_Pos                                     (1U)
#define    GPTIM_ECR_IDIR_Msk                                     (0x3U << GPTIM_ECR_IDIR_Pos)
#define    GPTIM_ECR_IDIR                                         GPTIM_ECR_IDIR_Msk

#define    GPTIM_ECR_INDEX_EN_Pos                                 (0U)
#define    GPTIM_ECR_INDEX_EN_Msk                                 (0x1U << GPTIM_ECR_INDEX_EN_Pos)
#define    GPTIM_ECR_INDEX_EN                                     GPTIM_ECR_INDEX_EN_Msk

#define    GPTIM_AFR_ETRSEL_Pos                                   (20U)
#define    GPTIM_AFR_ETRSEL_Msk                                   (0xfU << GPTIM_AFR_ETRSEL_Pos)
#define    GPTIM_AFR_ETRSEL                                       GPTIM_AFR_ETRSEL_Msk

#define    GPTIM_AFR_OCC1R_SEL_Pos                                (16U)
#define    GPTIM_AFR_OCC1R_SEL_Msk                                (0x7U << GPTIM_AFR_OCC1R_SEL_Pos)
#define    GPTIM_AFR_OCC1R_SEL                                    GPTIM_AFR_OCC1R_SEL_Msk



#define    FL_GPTIM_CHANNEL_1                                     (0x1U << 0U)
#define    FL_GPTIM_CHANNEL_2                                     (0x1U << 1U)
#define    FL_GPTIM_CHANNEL_3                                     (0x1U << 2U)
#define    FL_GPTIM_CHANNEL_4                                     (0x1U << 3U)
#define    FL_GPTIM_ITR0                                          (0x1U << 0U)
#define    FL_GPTIM_ITR1                                          (0x1U << 1U)
#define    FL_GPTIM_ITR2                                          (0x1U << 2U)
#define    FL_GPTIM_ITR3                                          (0x1U << 3U)



#define    FL_GPTIM_CLK_DIVISION_DIV1                             (0x0U << GPTIM_CR1_CKD_Pos)
#define    FL_GPTIM_CLK_DIVISION_DIV2                             (0x1U << GPTIM_CR1_CKD_Pos)
#define    FL_GPTIM_CLK_DIVISION_DIV4                             (0x2U << GPTIM_CR1_CKD_Pos)


#define    FL_GPTIM_COUNTER_ALIGNED_EDGE                          (0x0U << GPTIM_CR1_CMS_Pos)
#define    FL_GPTIM_COUNTER_ALIGNED_CENTER_DOWN                   (0x1U << GPTIM_CR1_CMS_Pos)
#define    FL_GPTIM_COUNTER_ALIGNED_CENTER_UP                     (0x2U << GPTIM_CR1_CMS_Pos)
#define    FL_GPTIM_COUNTER_ALIGNED_CENTER_UP_DOWN                (0x3U << GPTIM_CR1_CMS_Pos)


#define    FL_GPTIM_COUNTER_DIR_UP                                (0x0U << GPTIM_CR1_DIR_Pos)
#define    FL_GPTIM_COUNTER_DIR_DOWN                              (0x1U << GPTIM_CR1_DIR_Pos)


#define    FL_GPTIM_ONE_PULSE_MODE_CONTINUOUS                     (0x0U << GPTIM_CR1_OPM_Pos)
#define    FL_GPTIM_ONE_PULSE_MODE_SINGLE                         (0x1U << GPTIM_CR1_OPM_Pos)


#define    FL_GPTIM_UPDATE_SOURCE_REGULAR                         (0x0U << GPTIM_CR1_URS_Pos)
#define    FL_GPTIM_UPDATE_SOURCE_COUNTER                         (0x1U << GPTIM_CR1_URS_Pos)


#define    FL_GPTIM_TRGO_RESET                                    (0x0U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_ENABLE                                   (0x1U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_UPDATE                                   (0x2U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_CC1IF                                    (0x3U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_OC1REF                                   (0x4U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_OC2REF                                   (0x5U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_OC3REF                                   (0x6U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_OC4REF                                   (0x7U << GPTIM_CR2_MMS_Pos)


#define    FL_GPTIM_DMA_REQ_CC                                    (0x0U << GPTIM_CR2_CCDS_Pos)
#define    FL_GPTIM_DMA_REQ_UPDATE                                (0x1U << GPTIM_CR2_CCDS_Pos)


#define    FL_GPTIM_SMSP_SOURCE_UPDATE                            (0x0U << GPTIM_SMCR_SMSPS_Pos)
#define    FL_GPTIM_SMSP_SOURCE_INDEX                             (0x1U << GPTIM_SMCR_SMSPS_Pos)

#define    FL_GPTIM_OCREF_CLR                                     (0x0U << GPTIM_SMCR_OCCS_Pos)
#define    FL_GPTIM_OCREF_ETRF                                    (0x1U << GPTIM_SMCR_OCCS_Pos)

