Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_gptim.h
/**
  * @brief    
  * @rmtoll   CCER    CCINP    FL_GPTIM_ICN_SetChannelPolarity
  * @param    TIMx TIM instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_ICN_POLARITY_NORMAL
  *           @arg @ref FL_GPTIM_ICN_POLARITY_INVERT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_ICN_SetChannelPolarity(GPTIM_Type* TIMx, uint32_t polarity, uint32_t channel)
{
    MODIFY_REG(TIMx->CCER, (GPTIM_CCER_CCINP_Msk << ((channel - 1) * 4)), (polarity << ((channel - 1) * 4)));
}

/**
  * @brief    
  * @rmtoll   CCER    CCINP    FL_GPTIM_ICN_SetChannelPolarity
  * @param    TIMx TIM instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_ICN_POLARITY_NORMAL
  *           @arg @ref FL_GPTIM_ICN_POLARITY_INVERT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_GPTIM_ICN_GetChannelPolarity(GPTIM_Type* TIMx, uint32_t polarity, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER, (GPTIM_CCER_CCINP_Msk << ((channel - 1) * 4))) == (GPTIM_CCER_CCINP_Msk << ((channel - 1) * 4)));
}


/**
  * @brief    
  * @note     
  * @rmtoll   ECR    IPOS    FL_GPTIM_SetIndexPositionning
  * @param    TIMx TIM instance
  * @param    IndexPositionning This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_POSITION_DOWN_DOWN
  *           @arg @ref FL_GPTIM_INDEX_POSITION_DOWN_UP
  *           @arg @ref FL_GPTIM_INDEX_POSITION_UP_DOWN
  *           @arg @ref FL_GPTIM_INDEX_POSITION_UP_UP
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetIndexPositionning(GPTIM_Type* TIMx, uint32_t IndexPositionning)
{
    MODIFY_REG(TIMx->ECR, GPTIM_ECR_IPOS_Msk, IndexPositionning);
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    IPOS    FL_GPTIM_GetIndexPositionning
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_POSITION_DOWN_DOWN
  *           @arg @ref FL_GPTIM_INDEX_POSITION_DOWN_UP
  *           @arg @ref FL_GPTIM_INDEX_POSITION_UP_DOWN
  *           @arg @ref FL_GPTIM_INDEX_POSITION_UP_UP
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetIndexPositionning(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, GPTIM_ECR_IPOS_Msk));
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    FIDX    FL_GPTIM_SetIDXMode
  * @param    TIMx TIM instance
  * @param    IDXmode This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_FIRST_ONLY
  *           @arg @ref FL_GPTIM_INDEX_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetIDXMode(GPTIM_Type* TIMx, uint32_t IDXmode)
{
    MODIFY_REG(TIMx->ECR, GPTIM_ECR_FIDX_Msk, IDXmode);
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    FIDX    FL_GPTIM_GetIDXMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_FIRST_ONLY
  *           @arg @ref FL_GPTIM_INDEX_ALL
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetIDXMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, GPTIM_ECR_FIDX_Msk));
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    IDIR    FL_GPTIM_SetIDXDirection
  * @param    TIMx TIM instance
  * @param    IDXdirection This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_UP_DOWN
  *           @arg @ref FL_GPTIM_INDEX_UP
  *           @arg @ref FL_GPTIM_INDEX_DOWN
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetIDXDirection(GPTIM_Type* TIMx, uint32_t IDXdirection)
{
    MODIFY_REG(TIMx->ECR, GPTIM_ECR_IDIR_Msk, IDXdirection);
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    IDIR    FL_GPTIM_GetIDXDirection
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_UP_DOWN
  *           @arg @ref FL_GPTIM_INDEX_UP
  *           @arg @ref FL_GPTIM_INDEX_DOWN
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetIDXDirection(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, GPTIM_ECR_IDIR_Msk));
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    INDEX_EN    FL_GPTIM_EnableIDX
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_EnableIDX(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->ECR, GPTIM_ECR_INDEX_EN_Msk);
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    INDEX_EN    FL_GPTIM_IsEnabledIDX
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPTIM_IsEnabledIDX(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, GPTIM_ECR_INDEX_EN_Msk) == GPTIM_ECR_INDEX_EN_Msk);
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    INDEX_EN    FL_GPTIM_DisableIDX
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_DisableIDX(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->ECR, GPTIM_ECR_INDEX_EN_Msk);
}

/**
  * @brief    
  * @note     
  * @rmtoll   AFR    ETRSEL    FL_GPTIM_SetETRSource
  * @param    TIMx TIM instance
  * @param    ETRsource This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN0
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN1
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN2
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN3
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN4
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN5
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN6
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN7
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN8
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN9
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN10
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN11
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN12
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN13
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN14
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN15
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetETRSource(GPTIM_Type* TIMx, uint32_t ETRsource)
{
    MODIFY_REG(TIMx->AFR, GPTIM_AFR_ETRSEL_Msk, ETRsource);
}

/**
  * @brief    
  * @note     
  * @rmtoll   AFR    ETRSEL    FL_GPTIM_GetETRSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN0
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN1
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN2
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN3
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN4
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN5
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN6
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN7
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN8
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN9
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN10
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN11
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN12
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN13
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN14
  *           @arg @ref FL_GPTIM_ETRSOURCE_TIM_IN15
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetETRSource(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->AFR, GPTIM_AFR_ETRSEL_Msk));
}

/**
  * @brief    
  * @note     
  * @rmtoll   AFR    OCC1R_SEL    FL_GPTIM_SetOCRefClearSource
  * @param    TIMx TIM instance
  * @param    OCrefsource This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_OCREF_CLRSOURCE_COMP0
  *           @arg @ref FL_GPTIM_OCREF_CLRSOURCE_COMP1
  *           @arg @ref FL_GPTIM_OCREF_CLRSOURCE_COMP2
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetOCRefClearSource(GPTIM_Type* TIMx, uint32_t OCrefsource)
{
    MODIFY_REG(TIMx->AFR, GPTIM_AFR_OCC1R_SEL_Msk, OCrefsource);
}

/**
  * @brief    
  * @note     
  * @rmtoll   AFR    OCC1R_SEL    FL_GPTIM_GetOCRefClearSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_OCREF_CLRSOURCE_COMP0
  *           @arg @ref FL_GPTIM_OCREF_CLRSOURCE_COMP1
  *           @arg @ref FL_GPTIM_OCREF_CLRSOURCE_COMP2
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetOCRefClearSource(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->AFR, GPTIM_AFR_OCC1R_SEL_Msk));
}

/**
  * @}
  */

/** @defgroup GPTIM_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_GPTIM_IC_Init(GPTIM_Type *TIMx, uint32_t channel, FL_GPTIM_IC_InitTypeDef *ic_init);
FL_ErrorStatus FL_GPTIM_SlaveMode_Init(GPTIM_Type *TIMx, FL_GPTIM_SlaveInitTypeDef *slave_init);
FL_ErrorStatus FL_GPTIM_DeInit(GPTIM_Type *TIMx);
FL_ErrorStatus FL_GPTIM_Init(GPTIM_Type *TIMx, FL_GPTIM_InitTypeDef *init);
FL_ErrorStatus FL_GPTIM_OC_Init(GPTIM_Type *TIMx, uint32_t channel, FL_GPTIM_OC_InitTypeDef *ic_init); 
FL_ErrorStatus FL_GPTIM_ETR_Init(GPTIM_Type *TIMx, FL_GPTIM_ETR_InitTypeDef *etr_init);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LD5XX_FL_GPTIM_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2025-02-27*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
